/* automatically generated by rust-bindgen 0.70.1 */

pub const HAVE_AUBIO_DOUBLE: u32 = 0;
pub const AUBIO_SMPL_FMT: &[u8; 3] = b"%f\0";
pub const AUBIO_LSMP_FMT: &[u8; 4] = b"%lf\0";
pub type smpl_t = f32;
pub type lsmp_t = f64;
#[doc = " unsigned integer"]
pub type uint_t = ::std::os::raw::c_uint;
#[doc = " signed integer"]
pub type sint_t = ::std::os::raw::c_int;
#[doc = " character"]
pub type char_t = ::std::os::raw::c_char;
#[doc = " Buffer for real data\n\nVector of real-valued data\n\n::fvec_t is is the structure used to store vector of real-valued data, ::smpl_t .\n\n\\code\n\nuint_t buffer_size = 1024;\n\n// create a vector of 512 values\nfvec_t * input = new_fvec (buffer_size);\n\n// set some values of the vector\ninput->data[23] = 2.;\n// ..\n\n// compute the mean of the vector\nmean = fvec_mean(a_vector);\n\n// destroy the vector\ndel_fvec(a_vector);\n\n\\endcode\n\nSee `examples/` and `tests/src` directories for more examples.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fvec_t {
    #[doc = "< length of buffer"]
    pub length: uint_t,
    #[doc = "< data vector of length ::fvec_t.length"]
    pub data: *mut smpl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fvec_t"][::std::mem::size_of::<fvec_t>() - 16usize];
    ["Alignment of fvec_t"][::std::mem::align_of::<fvec_t>() - 8usize];
    ["Offset of field: fvec_t::length"][::std::mem::offset_of!(fvec_t, length) - 0usize];
    ["Offset of field: fvec_t::data"][::std::mem::offset_of!(fvec_t, data) - 8usize];
};
extern "C" {
    #[doc = " fvec_t buffer creation function\n\n\\param length the length of the buffer to create"]
    pub fn new_fvec(length: uint_t) -> *mut fvec_t;
}
extern "C" {
    #[doc = " fvec_t buffer deletion function\n\n\\param s buffer to delete as returned by new_fvec()"]
    pub fn del_fvec(s: *mut fvec_t);
}
extern "C" {
    #[doc = " read sample value in a buffer\n\n\\param s vector to read from\n\\param position sample position to read from"]
    pub fn fvec_get_sample(s: *const fvec_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " write sample value in a buffer\n\n\\param s vector to write to\n\\param data value to write in s->data[position]\n\\param position sample position to write to"]
    pub fn fvec_set_sample(s: *mut fvec_t, data: smpl_t, position: uint_t);
}
extern "C" {
    #[doc = " read data from a buffer\n\n\\param s vector to read from"]
    pub fn fvec_get_data(s: *const fvec_t) -> *mut smpl_t;
}
extern "C" {
    #[doc = " print out fvec data\n\n\\param s vector to print out"]
    pub fn fvec_print(s: *const fvec_t);
}
extern "C" {
    #[doc = " set all elements to a given value\n\n\\param s vector to modify\n\\param val value to set elements to"]
    pub fn fvec_set_all(s: *mut fvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all elements to zero\n\n\\param s vector to modify"]
    pub fn fvec_zeros(s: *mut fvec_t);
}
extern "C" {
    #[doc = " set all elements to ones\n\n\\param s vector to modify"]
    pub fn fvec_ones(s: *mut fvec_t);
}
extern "C" {
    #[doc = " revert order of vector elements\n\n\\param s vector to revert"]
    pub fn fvec_rev(s: *mut fvec_t);
}
extern "C" {
    #[doc = " apply weight to vector\n\nIf the weight vector is longer than s, only the first elements are used. If\nthe weight vector is shorter than s, the last elements of s are not weighted.\n\n\\param s vector to weight\n\\param weight weighting coefficients"]
    pub fn fvec_weight(s: *mut fvec_t, weight: *const fvec_t);
}
extern "C" {
    #[doc = " make a copy of a vector\n\n\\param s source vector\n\\param t vector to copy to"]
    pub fn fvec_copy(s: *const fvec_t, t: *mut fvec_t);
}
extern "C" {
    #[doc = " make a copy of a vector, applying weights to each element\n\n\\param in input vector\n\\param weight weights vector\n\\param out output vector"]
    pub fn fvec_weighted_copy(in_: *const fvec_t, weight: *const fvec_t, out: *mut fvec_t);
}
#[doc = " Vector of real-valued phase and spectrum data\n\n\\code\n\nuint_t buffer_size = 1024;\n\n// create a complex vector of 512 values\ncvec_t * input = new_cvec (buffer_size);\n\n// set some values of the vector\ninput->norm[23] = 2.;\ninput->phas[23] = M_PI;\n// ..\n\n// compute the mean of the vector\nmean = cvec_mean(input);\n\n// destroy the vector\ndel_cvec (input);\n\n\\endcode\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cvec_t {
    #[doc = "< length of buffer = (requested length)/2 + 1"]
    pub length: uint_t,
    #[doc = "< norm array of size ::cvec_t.length"]
    pub norm: *mut smpl_t,
    #[doc = "< phase array of size ::cvec_t.length"]
    pub phas: *mut smpl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cvec_t"][::std::mem::size_of::<cvec_t>() - 24usize];
    ["Alignment of cvec_t"][::std::mem::align_of::<cvec_t>() - 8usize];
    ["Offset of field: cvec_t::length"][::std::mem::offset_of!(cvec_t, length) - 0usize];
    ["Offset of field: cvec_t::norm"][::std::mem::offset_of!(cvec_t, norm) - 8usize];
    ["Offset of field: cvec_t::phas"][::std::mem::offset_of!(cvec_t, phas) - 16usize];
};
extern "C" {
    #[doc = " cvec_t buffer creation function\n\nThis function creates a cvec_t structure holding two arrays of size\n[length/2+1], corresponding to the norm and phase values of the\nspectral frame. The length stored in the structure is the actual size of both\narrays, not the length of the complex and symmetrical vector, specified as\ncreation argument.\n\n\\param length the length of the buffer to create"]
    pub fn new_cvec(length: uint_t) -> *mut cvec_t;
}
extern "C" {
    #[doc = " cvec_t buffer deletion function\n\n\\param s buffer to delete as returned by new_cvec()"]
    pub fn del_cvec(s: *mut cvec_t);
}
extern "C" {
    #[doc = " write norm value in a complex buffer\n\nThis is equivalent to:\n\\code\ns->norm[position] = val;\n\\endcode\n\n\\param s vector to write to\n\\param val norm value to write in s->norm[position]\n\\param position sample position to write to"]
    pub fn cvec_norm_set_sample(s: *mut cvec_t, val: smpl_t, position: uint_t);
}
extern "C" {
    #[doc = " write phase value in a complex buffer\n\nThis is equivalent to:\n\\code\ns->phas[position] = val;\n\\endcode\n\n\\param s vector to write to\n\\param val phase value to write in s->phas[position]\n\\param position sample position to write to"]
    pub fn cvec_phas_set_sample(s: *mut cvec_t, val: smpl_t, position: uint_t);
}
extern "C" {
    #[doc = " read norm value from a complex buffer\n\nThis is equivalent to:\n\\code\nsmpl_t foo = s->norm[position];\n\\endcode\n\n\\param s vector to read from\n\\param position sample position to read from"]
    pub fn cvec_norm_get_sample(s: *mut cvec_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " read phase value from a complex buffer\n\nThis is equivalent to:\n\\code\nsmpl_t foo = s->phas[position];\n\\endcode\n\n\\param s vector to read from\n\\param position sample position to read from\n\\returns the value of the sample at position"]
    pub fn cvec_phas_get_sample(s: *mut cvec_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " read norm data from a complex buffer\n\n\\code\nsmpl_t *data = s->norm;\n\\endcode\n\n\\param s vector to read from"]
    pub fn cvec_norm_get_data(s: *const cvec_t) -> *mut smpl_t;
}
extern "C" {
    #[doc = " read phase data from a complex buffer\n\nThis is equivalent to:\n\\code\nsmpl_t *data = s->phas;\n\\endcode\n\n\\param s vector to read from"]
    pub fn cvec_phas_get_data(s: *const cvec_t) -> *mut smpl_t;
}
extern "C" {
    #[doc = " print out cvec data\n\n\\param s vector to print out"]
    pub fn cvec_print(s: *const cvec_t);
}
extern "C" {
    #[doc = " make a copy of a vector\n\n\\param s source vector\n\\param t vector to copy to"]
    pub fn cvec_copy(s: *const cvec_t, t: *mut cvec_t);
}
extern "C" {
    #[doc = " set all norm elements to a given value\n\n\\param s vector to modify\n\\param val value to set elements to"]
    pub fn cvec_norm_set_all(s: *mut cvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all norm elements to zero\n\n\\param s vector to modify"]
    pub fn cvec_norm_zeros(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all norm elements to one\n\n\\param s vector to modify"]
    pub fn cvec_norm_ones(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all phase elements to a given value\n\n\\param s vector to modify\n\\param val value to set elements to"]
    pub fn cvec_phas_set_all(s: *mut cvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all phase elements to zero\n\n\\param s vector to modify"]
    pub fn cvec_phas_zeros(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all phase elements to one\n\n\\param s vector to modify"]
    pub fn cvec_phas_ones(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all norm and phas elements to zero\n\n\\param s vector to modify"]
    pub fn cvec_zeros(s: *mut cvec_t);
}
extern "C" {
    #[doc = " take logarithmic magnitude\n\n\\param s input cvec to compress\n\\param lambda value to use for normalisation\n\n\\f$ S_k = log( \\lambda * S_k + 1 ) \\f$"]
    pub fn cvec_logmag(s: *mut cvec_t, lambda: smpl_t);
}
#[doc = " Buffer for real data in double precision"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lvec_t {
    #[doc = "< length of buffer"]
    pub length: uint_t,
    #[doc = "< data array of size [length]"]
    pub data: *mut lsmp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lvec_t"][::std::mem::size_of::<lvec_t>() - 16usize];
    ["Alignment of lvec_t"][::std::mem::align_of::<lvec_t>() - 8usize];
    ["Offset of field: lvec_t::length"][::std::mem::offset_of!(lvec_t, length) - 0usize];
    ["Offset of field: lvec_t::data"][::std::mem::offset_of!(lvec_t, data) - 8usize];
};
extern "C" {
    #[doc = " lvec_t buffer creation function\n\n\\param length the length of the buffer to create"]
    pub fn new_lvec(length: uint_t) -> *mut lvec_t;
}
extern "C" {
    #[doc = " lvec_t buffer deletion function\n\n\\param s buffer to delete as returned by new_lvec()"]
    pub fn del_lvec(s: *mut lvec_t);
}
extern "C" {
    #[doc = " read sample value in a buffer\n\n\\param s vector to read from\n\\param position sample position to read from"]
    pub fn lvec_get_sample(s: *mut lvec_t, position: uint_t) -> lsmp_t;
}
extern "C" {
    #[doc = " write sample value in a buffer\n\n\\param s vector to write to\n\\param data value to write in s->data[position]\n\\param position sample position to write to"]
    pub fn lvec_set_sample(s: *mut lvec_t, data: lsmp_t, position: uint_t);
}
extern "C" {
    #[doc = " read data from a buffer\n\n\\param s vector to read from"]
    pub fn lvec_get_data(s: *const lvec_t) -> *mut lsmp_t;
}
extern "C" {
    #[doc = " print out lvec data\n\n\\param s vector to print out"]
    pub fn lvec_print(s: *const lvec_t);
}
extern "C" {
    #[doc = " set all elements to a given value\n\n\\param s vector to modify\n\\param val value to set elements to"]
    pub fn lvec_set_all(s: *mut lvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all elements to zero\n\n\\param s vector to modify"]
    pub fn lvec_zeros(s: *mut lvec_t);
}
extern "C" {
    #[doc = " set all elements to ones\n\n\\param s vector to modify"]
    pub fn lvec_ones(s: *mut lvec_t);
}
#[doc = " Buffer for real data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmat_t {
    #[doc = "< length of matrix"]
    pub length: uint_t,
    #[doc = "< height of matrix"]
    pub height: uint_t,
    #[doc = "< data array of size [length] * [height]"]
    pub data: *mut *mut smpl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmat_t"][::std::mem::size_of::<fmat_t>() - 16usize];
    ["Alignment of fmat_t"][::std::mem::align_of::<fmat_t>() - 8usize];
    ["Offset of field: fmat_t::length"][::std::mem::offset_of!(fmat_t, length) - 0usize];
    ["Offset of field: fmat_t::height"][::std::mem::offset_of!(fmat_t, height) - 4usize];
    ["Offset of field: fmat_t::data"][::std::mem::offset_of!(fmat_t, data) - 8usize];
};
extern "C" {
    #[doc = " fmat_t buffer creation function\n\n\\param length the length of the matrix to create\n\\param height the height of the matrix to create"]
    pub fn new_fmat(height: uint_t, length: uint_t) -> *mut fmat_t;
}
extern "C" {
    #[doc = " fmat_t buffer deletion function\n\n\\param s buffer to delete as returned by new_fmat()"]
    pub fn del_fmat(s: *mut fmat_t);
}
extern "C" {
    #[doc = " read sample value in a buffer\n\n\\param s vector to read from\n\\param channel channel to read from\n\\param position sample position to read from"]
    pub fn fmat_get_sample(s: *const fmat_t, channel: uint_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " write sample value in a buffer\n\n\\param s vector to write to\n\\param data value to write in s->data[channel][position]\n\\param channel channel to write to\n\\param position sample position to write to"]
